{
  "tickets": [
    {
      "id": "TF-20260216-0001",
      "channel": "gmail",
      "customer_name": "Sarah Mitchell",
      "customer_email": "sarah.mitchell84@gmail.com",
      "customer_plan": "pro",
      "subject": "Password Reset Request",
      "message": "Hi TaskFlow Support,\n\nI need to reset my password for my account. I tried using the 'Forgot Password' link on the login page, but I never received the reset email. I've checked my spam and junk folders and there's nothing there. My account email is sarah.mitchell84@gmail.com.\n\nCould you please send a manual password reset link or help me regain access? I have an important project deadline tomorrow and I really need to get back into my workspace.\n\nThank you for your help.\n\nBest regards,\nSarah Mitchell",
      "category": "account",
      "priority": "high",
      "sentiment": 0.6,
      "expected_action": "Verify account ownership, manually trigger password reset email, check if email delivery is blocked, and confirm reset link is sent successfully.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0002",
      "channel": "gmail",
      "customer_name": "James Thornton",
      "customer_email": "j.thornton@techventures.io",
      "customer_plan": "enterprise",
      "subject": "Locked out after enabling 2FA - lost recovery codes",
      "message": "Hello Support Team,\n\nI enabled two-factor authentication on my account last week as part of our company's security policy. Unfortunately, my phone was damaged over the weekend and I no longer have access to my authenticator app. I also cannot locate the recovery codes that were generated during setup.\n\nI am the workspace administrator for TechVentures (50+ users), and I'm currently completely locked out of my account. This is blocking our entire team's workflow as I'm the only one with permission to manage billing and user access.\n\nPlease advise on how to verify my identity and regain access. I can provide any verification documents you need. This is quite urgent.\n\nRegards,\nJames Thornton\nCTO, TechVentures Inc.",
      "category": "account",
      "priority": "critical",
      "sentiment": 0.4,
      "expected_action": "Initiate identity verification process, disable 2FA after verification, generate new recovery codes, and provide guidance on securely storing codes. Escalate due to enterprise admin lockout.",
      "should_escalate": true,
      "escalation_reason": "Enterprise workspace administrator locked out, blocking 50+ users. Requires identity verification and manual 2FA reset."
    },
    {
      "id": "TF-20260216-0003",
      "channel": "gmail",
      "customer_name": "Priya Desai",
      "customer_email": "priya.desai@innovatelab.com",
      "customer_plan": "pro",
      "subject": "Slack integration notifications stopped working",
      "message": "Hi there,\n\nWe've been using the TaskFlow-Slack integration for about three months now with no issues. However, since last Tuesday, none of our Slack channels are receiving notifications from TaskFlow. We haven't changed any settings on our end.\n\nI've tried disconnecting and reconnecting the integration, but the issue persists. Our team relies heavily on these notifications to stay updated on task changes, and the lack of alerts is causing us to miss important updates.\n\nCould you please look into this? Our workspace ID is WS-4872.\n\nThanks,\nPriya Desai\nProject Manager, InnovateLab",
      "category": "technical",
      "priority": "high",
      "sentiment": 0.5,
      "expected_action": "Check Slack integration webhook status for workspace WS-4872, verify OAuth tokens haven't expired, check for any platform-wide Slack integration issues, and guide through re-authorization if needed.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0004",
      "channel": "gmail",
      "customer_name": "Michael Chen",
      "customer_email": "mchen.dev@gmail.com",
      "customer_plan": "pro",
      "subject": "How to set up automations for task status changes",
      "message": "Hello TaskFlow Team,\n\nI recently upgraded to the Pro plan and I'm trying to set up automations for my team. Specifically, I want to create rules that automatically move tasks to 'In Review' when a team member marks them as 'Done', and also send a notification to the project lead.\n\nI found the automation section in settings, but the interface isn't very intuitive and I'm not sure how to chain multiple actions together. Is there a step-by-step guide or video tutorial for this?\n\nAlso, is there a limit on how many automations I can create on the Pro plan?\n\nThanks in advance,\nMichael Chen",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.7,
      "expected_action": "Provide step-by-step instructions for setting up task status automations, link to relevant documentation and video tutorials, and clarify Pro plan automation limits.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0005",
      "channel": "gmail",
      "customer_name": "Rebecca Torres",
      "customer_email": "r.torres@brightpath.co",
      "customer_plan": "enterprise",
      "subject": "Gantt view not loading - stuck on spinner",
      "message": "Hi Support,\n\nOur team has been experiencing an issue with the Gantt chart view for the past two days. When we navigate to the Gantt view in any project, the page just shows a loading spinner indefinitely. We've tried on Chrome, Firefox, and Edge, and the issue happens on all browsers. Clearing cache and cookies didn't help either.\n\nThis is a critical tool for our project planning and we need it resolved as soon as possible. Our workspace has approximately 200 active projects, if that helps with troubleshooting.\n\nPlease let me know if you need any additional information.\n\nBest,\nRebecca Torres\nOperations Director, BrightPath Consulting",
      "category": "bug-report",
      "priority": "critical",
      "sentiment": 0.4,
      "expected_action": "Investigate potential performance issue with Gantt view on large workspaces, check server logs for errors, test with workspace data set, and provide timeline for resolution. Consider if workspace size (200 projects) is causing timeout.",
      "should_escalate": true,
      "escalation_reason": "Critical feature (Gantt view) completely non-functional for enterprise customer with 200 active projects. Likely a performance/infrastructure issue requiring engineering investigation."
    },
    {
      "id": "TF-20260216-0006",
      "channel": "gmail",
      "customer_name": "David Park",
      "customer_email": "david.park92@gmail.com",
      "customer_plan": "pro",
      "subject": "Requesting refund - I was charged after cancelling my subscription",
      "message": "Hello,\n\nI cancelled my Pro subscription on January 28th, 2026. I received a cancellation confirmation email at that time. However, I was just charged $24.99 on February 15th for another month of Pro.\n\nI want an immediate refund for this charge. I already cancelled and should not have been billed. I've attached a screenshot of my cancellation confirmation email for reference.\n\nIf this isn't resolved quickly, I will be filing a dispute with my credit card company.\n\nDavid Park",
      "category": "billing",
      "priority": "high",
      "sentiment": 0.2,
      "expected_action": "Verify cancellation date in system, check billing records, process refund if cancellation was indeed made before billing cycle, and apologize for the error. Escalate to billing team.",
      "should_escalate": true,
      "escalation_reason": "Billing dispute - customer claims charge after cancellation. Refund required. Customer threatening credit card dispute."
    },
    {
      "id": "TF-20260216-0007",
      "channel": "gmail",
      "customer_name": "Laura Jenkins",
      "customer_email": "laurajenkins.pm@gmail.com",
      "customer_plan": "free",
      "subject": "How to import projects from Trello",
      "message": "Hi TaskFlow,\n\nI'm currently migrating my team from Trello to TaskFlow. I have about 15 boards in Trello with hundreds of cards, labels, and comments that I need to bring over.\n\nDoes TaskFlow support importing from Trello? If so, could you walk me through the process? I want to make sure the labels, assignees, and due dates all transfer correctly.\n\nAlso, would I need to upgrade to Pro for the import feature, or is it available on the free plan?\n\nThank you!\nLaura Jenkins",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.8,
      "expected_action": "Provide instructions for Trello import feature, explain what data is transferred (labels, assignees, due dates, comments), clarify plan requirements for import, and offer assistance during migration.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0008",
      "channel": "gmail",
      "customer_name": "Kevin Okafor",
      "customer_email": "kevin.okafor@zenithgroup.com",
      "customer_plan": "pro",
      "subject": "Google Drive integration - Access Denied error",
      "message": "Dear Support Team,\n\nI'm trying to connect Google Drive to our TaskFlow workspace so we can attach files from Drive directly to tasks. When I go through the authorization flow, everything seems to work fine, but when I try to browse or attach files, I get an 'Access Denied' error.\n\nI've confirmed that I have the correct Google account connected and that my Drive permissions are set correctly. I've also tried revoking and re-granting access, but the problem persists.\n\nOur IT department has confirmed there are no firewall or proxy rules blocking the connection. Is this a known issue?\n\nBest regards,\nKevin Okafor\nSenior Analyst, Zenith Group",
      "category": "technical",
      "priority": "medium",
      "sentiment": 0.5,
      "expected_action": "Check if Google Drive OAuth scopes are correct, verify API permissions, guide through re-authorization with correct scopes, and check if Google Workspace admin restrictions are in place.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0009",
      "channel": "gmail",
      "customer_name": "Amanda Stewart",
      "customer_email": "a.stewart@modernworks.io",
      "customer_plan": "pro",
      "subject": "Team member cannot see private project after being added",
      "message": "Hi there,\n\nI added my colleague (jess.huang@modernworks.io) to a private project called 'Q1 Marketing Strategy' yesterday, but she still can't see it in her project list. I've double-checked that she was added with 'Member' access and she's confirmed she's logged into the correct account.\n\nShe can see other projects in the workspace just fine. It's only this specific private project that's not showing up. I've tried removing and re-adding her, but the issue remains.\n\nCould you please look into this?\n\nThanks,\nAmanda Stewart",
      "category": "bug-report",
      "priority": "medium",
      "sentiment": 0.5,
      "expected_action": "Check project membership settings and permissions for the specific project, verify the invite was processed, check for caching issues, and test access from the affected user's account.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0010",
      "channel": "gmail",
      "customer_name": "Richard Hoffman",
      "customer_email": "r.hoffman@scaleupcorp.com",
      "customer_plan": "enterprise",
      "subject": "Requesting bulk discount for 50 users",
      "message": "Dear TaskFlow Sales/Support Team,\n\nI'm the Head of Operations at ScaleUp Corp and we're looking to expand our TaskFlow Enterprise deployment from 20 to 50 users. Before we proceed, I'd like to discuss potential volume discounts for this number of seats.\n\nWe've been very happy with TaskFlow over the past year and would like to roll it out to our entire product and engineering organization. However, the per-seat pricing at 50 users becomes a significant budget item and we'd like to explore if there's any flexibility.\n\nWould it be possible to schedule a call with someone from your sales team to discuss pricing options?\n\nBest regards,\nRichard Hoffman\nHead of Operations, ScaleUp Corp",
      "category": "billing",
      "priority": "medium",
      "sentiment": 0.8,
      "expected_action": "Forward to sales team for volume discount discussion, acknowledge the request warmly, provide general information about enterprise pricing tiers, and schedule a call with a sales representative.",
      "should_escalate": true,
      "escalation_reason": "Sales opportunity - enterprise customer looking to expand from 20 to 50 seats. Requires sales team involvement for custom pricing."
    },
    {
      "id": "TF-20260216-0011",
      "channel": "gmail",
      "customer_name": "Natalie Ruiz",
      "customer_email": "natalie.ruiz@gmail.com",
      "customer_plan": "pro",
      "subject": "Tasks not syncing between web and mobile app",
      "message": "Hello Support,\n\nI've noticed that tasks I create or update on the web app aren't appearing on my mobile app (iOS), and vice versa. For example, I marked three tasks as complete on my phone this morning, but they still show as 'In Progress' on the web.\n\nI've tried force-quitting the app and logging out and back in, but the sync issue continues. I'm running TaskFlow mobile version 3.4.2 and using Chrome on the web.\n\nThis is really frustrating because I often work from my phone when I'm in meetings and need everything to stay in sync. Please help.\n\nThank you,\nNatalie Ruiz",
      "category": "bug-report",
      "priority": "high",
      "sentiment": 0.3,
      "expected_action": "Check for known sync issues between web and mobile, verify app version is up to date, check server-side sync logs for the user, and provide troubleshooting steps including reinstalling the mobile app.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0012",
      "channel": "gmail",
      "customer_name": "Thomas Wright",
      "customer_email": "t.wright@bluepointconsulting.com",
      "customer_plan": "pro",
      "subject": "How to export time tracking data for invoicing",
      "message": "Hi TaskFlow Team,\n\nWe use the time tracking feature extensively for client billing. I need to export time tracking data for the month of January 2026, broken down by project, team member, and task.\n\nI can see individual time entries in each task, but I can't find a way to generate a consolidated report or export the data as CSV. Is there an export option I'm missing, or do I need to use the API for this?\n\nAlso, it would be incredibly helpful if the export included billable vs. non-billable hours. Is that possible?\n\nThanks for your help,\nThomas Wright\nBluePoint Consulting",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.7,
      "expected_action": "Guide through time tracking report generation and CSV export, explain filtering options (by project, team member, date range), and clarify billable/non-billable hour tracking capabilities.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0013",
      "channel": "gmail",
      "customer_name": "Eric Johansson",
      "customer_email": "eric.j@devstream.tech",
      "customer_plan": "pro",
      "subject": "GitHub commits not linking to tasks - TF-ID format issue",
      "message": "Hi Support,\n\nWe connected our GitHub repositories to TaskFlow about a week ago. According to your docs, including the task ID (e.g., TF-1234) in a commit message should automatically link the commit to the corresponding task in TaskFlow.\n\nWe've been including the IDs in our commit messages, but none of the commits are showing up in the task activity feeds. Here are a couple of example commits:\n\n- 'Fix user validation logic TF-3421'\n- 'TF-3422 Update API response format'\n\nOur GitHub org is 'devstream-tech'. Could you check if the integration is set up correctly on your end?\n\nThanks,\nEric Johansson\nLead Developer, DevStream Technologies",
      "category": "technical",
      "priority": "medium",
      "sentiment": 0.5,
      "expected_action": "Verify GitHub integration configuration, check webhook delivery logs, confirm correct repository is connected, verify task ID format matches expected pattern, and test the linking manually.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0014",
      "channel": "gmail",
      "customer_name": "Claudia Becker",
      "customer_email": "claudia.becker@eurolegal.de",
      "customer_plan": "enterprise",
      "subject": "GDPR Data Deletion Request - Immediate Action Required",
      "message": "Dear TaskFlow Data Protection Team,\n\nPursuant to Article 17 of the General Data Protection Regulation (GDPR), I am formally requesting the complete deletion of all personal data associated with my account and our organization's workspace (EuroLegal Partners, workspace ID: WS-7231).\n\nWe are discontinuing our use of TaskFlow and require that all data, including but not limited to user profiles, project data, uploaded files, activity logs, and any analytics data, be permanently deleted from your systems and backups.\n\nPlease confirm within 72 hours that this request has been received and provide a timeline for complete data erasure. Under GDPR, you are required to fulfill this request within 30 days.\n\nKind regards,\nClaudia Becker\nData Protection Officer\nEuroLegal Partners GmbH",
      "category": "account",
      "priority": "critical",
      "sentiment": 0.4,
      "expected_action": "Acknowledge GDPR deletion request immediately, escalate to legal/compliance team, provide confirmation of receipt within 72 hours, initiate data deletion process, and provide timeline for completion within 30-day GDPR requirement.",
      "should_escalate": true,
      "escalation_reason": "GDPR Article 17 data deletion request from enterprise customer's Data Protection Officer. Legal compliance requirement with 30-day deadline."
    },
    {
      "id": "TF-20260216-0015",
      "channel": "gmail",
      "customer_name": "Rachel Kim",
      "customer_email": "rachel.kim@orbitalanalytics.com",
      "customer_plan": "enterprise",
      "subject": "Reporting dashboard extremely slow to load",
      "message": "Hello,\n\nOur reporting dashboard has become nearly unusable over the past week. Widgets that used to load in 2-3 seconds are now taking upwards of 30 seconds, and some are timing out entirely. This affects all users in our workspace, not just my account.\n\nWe have about 150 active projects and around 12,000 tasks across them. The issue seems to be worse when loading the 'Team Workload' and 'Sprint Velocity' widgets specifically.\n\nWe depend on these reports for our daily standups and weekly stakeholder meetings. Is there something going on with your servers, or is our workspace hitting some kind of performance limit?\n\nThanks,\nRachel Kim\nDirector of Analytics, Orbital Analytics",
      "category": "bug-report",
      "priority": "high",
      "sentiment": 0.4,
      "expected_action": "Investigate dashboard performance for the workspace, check server-side query performance for large data sets, identify if specific widgets have known scaling issues, and provide an estimated timeline for improvement.",
      "should_escalate": true,
      "escalation_reason": "Performance degradation affecting enterprise customer's core workflow. Large workspace (150 projects, 12K tasks) potentially hitting scaling limits. Requires engineering investigation."
    },
    {
      "id": "TF-20260216-0016",
      "channel": "gmail",
      "customer_name": "Marcus Thompson",
      "customer_email": "marcus.t@widescreen.media",
      "customer_plan": "pro",
      "subject": "THIRD TIME contacting support - sync issue STILL not resolved",
      "message": "This is the THIRD time I am contacting you about the same issue and I am beyond frustrated.\n\nI first reported on January 20th (ticket TF-20260120-0892) that tasks are randomly disappearing from my board views. I was told it was a 'known issue' and would be fixed. I followed up on February 3rd (ticket TF-20260203-1104) and was told the engineering team was 'working on it.'\n\nIt is now February 16th and NOTHING has changed. Tasks are still vanishing from our Kanban boards. My team of 12 people is losing work and we are losing trust in your product.\n\nI need a concrete answer: WHEN will this be fixed? If you cannot give me a definitive timeline, we will be migrating to a competitor. I expect a response from a manager, not another templated reply.\n\nMarcus Thompson\nCreative Director, WideScreen Media",
      "category": "complaint",
      "priority": "critical",
      "sentiment": 0.1,
      "expected_action": "Immediately escalate to support manager, review previous ticket history (TF-20260120-0892 and TF-20260203-1104), get engineering update on the bug fix timeline, provide a personal response with concrete timeline, and offer compensation for poor experience.",
      "should_escalate": true,
      "escalation_reason": "Repeat complaint (3rd contact) about unresolved bug. Customer is angry, threatening to churn. Requires manager response and engineering timeline."
    },
    {
      "id": "TF-20260216-0017",
      "channel": "gmail",
      "customer_name": "Jennifer Walsh",
      "customer_email": "j.walsh@apexsolutions.com",
      "customer_plan": "enterprise",
      "subject": "SSO setup for Enterprise plan - SAML configuration",
      "message": "Hello TaskFlow Team,\n\nWe recently upgraded to the Enterprise plan and I'm looking to configure SSO (Single Sign-On) using SAML 2.0 with our Okta identity provider.\n\nCould you please provide the following:\n1. TaskFlow's SAML metadata URL or XML file\n2. The ACS (Assertion Consumer Service) URL\n3. The Entity ID for TaskFlow\n4. Any specific attribute mapping requirements\n\nAlso, once SSO is enabled, will existing users need to re-authenticate, or will the transition be seamless?\n\nI'd appreciate any documentation or guides you have for the Okta-specific setup.\n\nThank you,\nJennifer Walsh\nIT Administrator, Apex Solutions",
      "category": "how-to",
      "priority": "medium",
      "sentiment": 0.7,
      "expected_action": "Provide SAML configuration details (metadata URL, ACS URL, Entity ID), share Okta-specific integration guide, explain attribute mapping requirements, and clarify the transition process for existing users.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0018",
      "channel": "gmail",
      "customer_name": "Brian Lawson",
      "customer_email": "brian.lawson@creativeforge.co",
      "customer_plan": "pro",
      "subject": "File upload failing for files over 200MB",
      "message": "Hi Support,\n\nI'm unable to upload files larger than about 200MB to task attachments. When I try to upload a 250MB design file, the upload progress bar gets to about 80% and then fails with a generic 'Upload failed' error.\n\nSmaller files (under 100MB) upload fine. I've tried different browsers and even different internet connections, so it's not a local issue.\n\nWe regularly need to share large design assets (PSD, AI, video files) through TaskFlow. What's the current file size limit, and is there a way to increase it on the Pro plan?\n\nThanks,\nBrian Lawson\nDesign Lead, CreativeForge",
      "category": "technical",
      "priority": "medium",
      "sentiment": 0.5,
      "expected_action": "Clarify file size limits for Pro plan (likely 250MB), investigate the upload failure at 80%, suggest alternative approaches for large files (Google Drive/Dropbox integration), and check if there's a timeout issue.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0019",
      "channel": "gmail",
      "customer_name": "Samantha Nguyen",
      "customer_email": "s.nguyen@rapidflow.io",
      "customer_plan": "pro",
      "subject": "Automation running but Slack notifications not sending",
      "message": "Hello,\n\nI've set up an automation that triggers when a task moves to 'Done' status. The automation has two actions: (1) assign a label 'Completed' and (2) send a notification to our #project-updates Slack channel.\n\nThe label is being applied correctly, so the automation is triggering. However, the Slack notification part is not working. The automation history shows the Slack step as 'completed' but no message actually appears in the channel.\n\nOur Slack integration is otherwise working fine for manual notifications. It's only the automation-triggered Slack messages that aren't going through.\n\nCan you help?\n\nThanks,\nSamantha Nguyen",
      "category": "bug-report",
      "priority": "medium",
      "sentiment": 0.5,
      "expected_action": "Investigate the discrepancy between automation history showing success and actual Slack delivery failure, check Slack bot permissions for automated messages, verify channel permissions, and test with a simple automation.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0020",
      "channel": "gmail",
      "customer_name": "Alex Rivera",
      "customer_email": "alex.rivera.dev@gmail.com",
      "customer_plan": "pro",
      "subject": "Question about API rate limits on Pro plan",
      "message": "Hi TaskFlow Team,\n\nI'm building a custom integration using the TaskFlow API and I wanted to clarify the rate limits for the Pro plan. The documentation mentions a limit but the exact numbers seem inconsistent between the API docs and the pricing page.\n\nSpecifically, I need to know:\n1. What's the request limit per minute/hour?\n2. Is there a separate limit for read vs. write operations?\n3. Are webhook deliveries counted against the rate limit?\n4. Is there a way to check my current usage via an API endpoint?\n\nWe're planning to sync task data every 5 minutes with our internal tools and I want to make sure we won't hit any limits.\n\nThanks for clarifying,\nAlex Rivera",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.7,
      "expected_action": "Provide clear API rate limit details for Pro plan, clarify read vs. write limits, explain webhook counting, share rate limit header information, and suggest efficient polling strategies.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0021",
      "channel": "gmail",
      "customer_name": "Olivia Barnes",
      "customer_email": "olivia.barnes@peakproductivity.com",
      "customer_plan": "pro",
      "subject": "Considering switching to Asana - Can you help me decide?",
      "message": "Hello,\n\nI've been using TaskFlow Pro for about 6 months with my team of 15 people. Overall it's been decent, but we've been evaluating Asana as a potential alternative.\n\nA few things that have us considering the switch:\n- Asana seems to have better native reporting capabilities\n- Their timeline view feels more polished than TaskFlow's Gantt chart\n- Portfolio-level project tracking is something we really need\n\nBefore we make a decision, I wanted to ask: Are any of these areas on your roadmap for improvement? We'd prefer to stay with TaskFlow if these gaps will be addressed soon, as we've already invested time in setting up our workflows.\n\nI'd appreciate an honest assessment rather than a sales pitch.\n\nBest,\nOlivia Barnes\nTeam Lead, Peak Productivity",
      "category": "feedback",
      "priority": "medium",
      "sentiment": 0.5,
      "expected_action": "Provide honest comparison addressing specific concerns (reporting, timeline view, portfolio tracking), share relevant roadmap items if possible, highlight TaskFlow-specific strengths, and offer a call with product team. Flag as churn risk.",
      "should_escalate": true,
      "escalation_reason": "Churn risk - Pro customer with 15 seats actively comparing competitors. Requires product/retention team involvement."
    },
    {
      "id": "TF-20260216-0022",
      "channel": "gmail",
      "customer_name": "Daniel Foster",
      "customer_email": "dan.foster@gmail.com",
      "customer_plan": "free",
      "subject": "How to set up recurring tasks",
      "message": "Hi TaskFlow Support,\n\nI'm trying to figure out how to create tasks that automatically repeat on a schedule. For example, I have a weekly team report that needs to be submitted every Friday, and monthly budget reviews on the first of each month.\n\nIs there a recurring task feature in TaskFlow? I looked through the task creation dialog but couldn't find an option for it. If it exists, could you point me in the right direction?\n\nIf it's a paid feature, that's fine too, just let me know which plan includes it.\n\nThank you,\nDaniel Foster",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.7,
      "expected_action": "Explain recurring task setup process, clarify which plans include this feature, provide step-by-step guide for setting up weekly and monthly recurrence patterns.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0023",
      "channel": "gmail",
      "customer_name": "Lisa Chang",
      "customer_email": "lisa.chang@brightideas.co",
      "customer_plan": "pro",
      "subject": "Calendar view not syncing with Google Calendar",
      "message": "Hi there,\n\nI connected my Google Calendar to TaskFlow so that task due dates would show up on my calendar. The initial sync worked fine and I could see my tasks as calendar events. However, it seems like the sync is only one-way and stopped updating about a week ago.\n\nNew tasks I create in TaskFlow don't appear in Google Calendar, and changes to due dates aren't reflected either. The integration still shows as 'Connected' in my settings.\n\nI've tried disconnecting and reconnecting, but after reconnecting, only tasks from the last 7 days show up, not all my upcoming tasks.\n\nPlease advise.\n\nThanks,\nLisa Chang",
      "category": "technical",
      "priority": "medium",
      "sentiment": 0.4,
      "expected_action": "Investigate Google Calendar sync issue, check OAuth token status, verify sync settings (one-way vs two-way), check for sync queue backlog, and guide through proper re-authorization.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0024",
      "channel": "gmail",
      "customer_name": "Robert Haines",
      "customer_email": "r.haines@globaltrading.com",
      "customer_plan": "enterprise",
      "subject": "Request for custom invoicing with PO numbers",
      "message": "Dear TaskFlow Billing Team,\n\nOur finance department requires that all vendor invoices include a Purchase Order (PO) number for our internal tracking and approval process. Currently, the invoices we receive from TaskFlow do not include this field.\n\nOur PO number for this vendor relationship is PO-2026-GT-4891. Could you please add this to all future invoices?\n\nAdditionally, we need invoices to be sent to our accounts payable email (ap@globaltrading.com) instead of my personal email. Is it possible to configure a separate billing contact?\n\nThank you for accommodating these requirements.\n\nBest regards,\nRobert Haines\nProcurement Manager, Global Trading Ltd.",
      "category": "billing",
      "priority": "medium",
      "sentiment": 0.7,
      "expected_action": "Forward PO number requirement to billing team, update invoice template with PO-2026-GT-4891, add ap@globaltrading.com as billing contact, and confirm changes for next invoice cycle.",
      "should_escalate": true,
      "escalation_reason": "Custom invoicing requirement for enterprise customer. Requires billing team to update invoice template and billing contact."
    },
    {
      "id": "TF-20260216-0025",
      "channel": "gmail",
      "customer_name": "Catherine Morales",
      "customer_email": "c.morales@westbridge.net",
      "customer_plan": "pro",
      "subject": "Multiple issues - login problems, sync failures, and missing tasks",
      "message": "Hello TaskFlow Support,\n\nI'm writing because I've been experiencing several issues simultaneously and I'm not sure if they're related. Let me describe each one:\n\n1. LOGIN ISSUES: For the past three days, I've been intermittently unable to log in. I get a 'Session expired' error even though I just entered my credentials. It usually works after 3-4 attempts but it's very annoying.\n\n2. SYNC PROBLEMS: When I do manage to log in, I'm noticing that tasks I edited on Monday are reverting to their previous state. For example, I updated the description and due date on task TF-9012, but when I checked today, it had the old description and the due date was wrong.\n\n3. MISSING TASKS: Most concerning, there are approximately 8-10 tasks that seem to have completely vanished from our 'Q1 Product Launch' project. These tasks definitely existed last week - I have screenshots showing them in the board view. They're not in the trash either.\n\nI'm starting to worry about data integrity. Can someone please look into all of these issues? Our team of 8 depends on TaskFlow daily and these problems are severely impacting our productivity.\n\nPlease treat this as urgent.\n\nCatherine Morales\nProduct Manager, WestBridge Solutions",
      "category": "bug-report",
      "priority": "critical",
      "sentiment": 0.2,
      "expected_action": "Escalate immediately for data integrity investigation. Check server logs for session issues, investigate data reversion (possible database consistency issue), search for missing tasks in audit logs, and provide personal follow-up with timeline.",
      "should_escalate": true,
      "escalation_reason": "Multiple critical issues including potential data loss (missing tasks, data reversion). Data integrity concern requires immediate engineering investigation."
    },
    {
      "id": "TF-20260216-0026",
      "channel": "whatsapp",
      "customer_name": "Tyler Brooks",
      "customer_email": "tyler.brooks99@gmail.com",
      "customer_plan": "free",
      "subject": "Cannot login",
      "message": "cant login help",
      "category": "account",
      "priority": "medium",
      "sentiment": 0.4,
      "expected_action": "Ask for more details: what error message they see, which email they use to log in, and whether they've tried resetting their password.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0027",
      "channel": "whatsapp",
      "customer_name": "Maria Gonzalez",
      "customer_email": "maria.g.gonzalez@gmail.com",
      "customer_plan": "free",
      "subject": "Adding team members to project",
      "message": "how do I add people to my project?",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.6,
      "expected_action": "Provide brief instructions: go to project settings > members > invite by email. Mention free plan member limits.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0028",
      "channel": "whatsapp",
      "customer_name": "Chris Patel",
      "customer_email": "chrispatel22@gmail.com",
      "customer_plan": "free",
      "subject": "Free trial inquiry",
      "message": "is there a free trial?",
      "category": "billing",
      "priority": "low",
      "sentiment": 0.6,
      "expected_action": "Explain free plan features and 14-day Pro trial availability. Provide sign-up link.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0029",
      "channel": "whatsapp",
      "customer_name": "Ashley Williams",
      "customer_email": "ash.williams@gmail.com",
      "customer_plan": "pro",
      "subject": "Mobile app crashing",
      "message": "my app keeps crashing everytime i open it. using iphone 14 on latest ios",
      "category": "bug-report",
      "priority": "high",
      "sentiment": 0.3,
      "expected_action": "Ask for app version, suggest clearing cache, reinstalling the app, and check for known issues with latest iOS version. Collect crash details if possible.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0030",
      "channel": "whatsapp",
      "customer_name": "Jordan Lee",
      "customer_email": "jordanlee.work@gmail.com",
      "customer_plan": "free",
      "subject": "Finding time tracking feature",
      "message": "where do i find time tracking",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.6,
      "expected_action": "Explain that time tracking is available inside any task via the timer icon. Mention if it's a paid feature and which plans include it.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0031",
      "channel": "whatsapp",
      "customer_name": "Emma Diaz",
      "customer_email": "emma.diaz.work@gmail.com",
      "customer_plan": "free",
      "subject": "Unexpected charge on free plan",
      "message": "I was charged $12 but im on free plan?? i never upgraded",
      "category": "billing",
      "priority": "high",
      "sentiment": 0.2,
      "expected_action": "Investigate the charge, check if an accidental upgrade or trial conversion occurred, and process a refund if the charge was unauthorized. Escalate to billing.",
      "should_escalate": true,
      "escalation_reason": "Unauthorized billing charge on free plan account. Customer did not consent to upgrade. Refund investigation required."
    },
    {
      "id": "TF-20260216-0032",
      "channel": "whatsapp",
      "customer_name": "Ryan Murphy",
      "customer_email": "ryanmurph88@gmail.com",
      "customer_plan": "pro",
      "subject": "Error screenshot reference",
      "message": "getting this error see screenshot",
      "category": "technical",
      "priority": "medium",
      "sentiment": 0.4,
      "expected_action": "Let the customer know that no screenshot was received. Ask them to re-send the screenshot or describe the error message they're seeing, including what they were doing when it appeared.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0033",
      "channel": "whatsapp",
      "customer_name": "Zoe Baker",
      "customer_email": "zoebaker.ui@gmail.com",
      "customer_plan": "pro",
      "subject": "Dark mode feature request",
      "message": "can you add dark mode pls my eyes are dying lol",
      "category": "feature-request",
      "priority": "low",
      "sentiment": 0.6,
      "expected_action": "Thank the customer for the suggestion, log the feature request, and share that dark mode is being considered or is on the roadmap if applicable.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0034",
      "channel": "whatsapp",
      "customer_name": "Derek Sanders",
      "customer_email": "derek.s.sanders@gmail.com",
      "customer_plan": "pro",
      "subject": "Request to speak with human agent",
      "message": "need to talk to a real person this is urgent",
      "category": "complaint",
      "priority": "high",
      "sentiment": 0.2,
      "expected_action": "Acknowledge urgency, ask what the issue is so it can be routed correctly, and offer to connect them with a live agent or schedule a callback.",
      "should_escalate": true,
      "escalation_reason": "Customer explicitly requesting human agent contact. Urgent unspecified issue."
    },
    {
      "id": "TF-20260216-0035",
      "channel": "whatsapp",
      "customer_name": "Hannah Scott",
      "customer_email": "hannah.scott.pm@gmail.com",
      "customer_plan": "free",
      "subject": "How to delete a project",
      "message": "how to delete a project",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.5,
      "expected_action": "Provide instructions: go to project settings > scroll to bottom > 'Delete Project'. Warn that this is irreversible and suggest archiving instead if they just want to hide it.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0036",
      "channel": "whatsapp",
      "customer_name": "Jake Robinson",
      "customer_email": "jake.robinson14@gmail.com",
      "customer_plan": "pro",
      "subject": "Too many notifications",
      "message": "notifications are blowing up my phone how do i turn them off",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.3,
      "expected_action": "Guide through notification settings: Settings > Notifications > customize per channel (push, email, in-app). Suggest muting specific projects or setting quiet hours.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0037",
      "channel": "whatsapp",
      "customer_name": "Nicole Adams",
      "customer_email": "nicole.adams.biz@gmail.com",
      "customer_plan": "pro",
      "subject": "Microsoft Teams integration inquiry",
      "message": "does taskflow work with microsoft teams?",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.6,
      "expected_action": "Confirm whether Microsoft Teams integration is available, and if so, provide setup instructions. If not, mention it as a planned feature or suggest alternatives.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0038",
      "channel": "whatsapp",
      "customer_name": "Lucas Martin",
      "customer_email": "lucasmartin.x@gmail.com",
      "customer_plan": "free",
      "subject": "Greeting only",
      "message": "hi",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.5,
      "expected_action": "Respond with a friendly greeting and ask how you can help them today.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0039",
      "channel": "whatsapp",
      "customer_name": "Sofia Ramirez",
      "customer_email": "sofia.r.ramirez@gmail.com",
      "customer_plan": "free",
      "subject": "Emoji-only message",
      "message": "👍",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.6,
      "expected_action": "Respond with a friendly message acknowledging the thumbs up and ask if there's anything they need help with.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0040",
      "channel": "whatsapp",
      "customer_name": "Carlos Vega",
      "customer_email": "carlos.vega.mgmt@gmail.com",
      "customer_plan": "pro",
      "subject": "Admin access for boss",
      "message": "my boss needs access to all projects how do we set that up",
      "category": "how-to",
      "priority": "medium",
      "sentiment": 0.5,
      "expected_action": "Explain workspace admin/owner roles that grant visibility into all projects. Guide through Settings > Members > change role to Admin. Mention that Enterprise plan has more granular role options.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0041",
      "channel": "whatsapp",
      "customer_name": "Tina Campbell",
      "customer_email": "tina.campbell.ops@gmail.com",
      "customer_plan": "enterprise",
      "subject": "Tasks disappeared - urgent",
      "message": "urgent!! all our tasks just disappeared from the sprint board this morning. like everything is gone. we have a release tomorrow HELP",
      "category": "bug-report",
      "priority": "critical",
      "sentiment": 0.1,
      "expected_action": "Treat as critical data loss incident. Immediately check for data integrity issues, review audit logs, check if tasks were accidentally archived or filtered. Escalate to engineering immediately.",
      "should_escalate": true,
      "escalation_reason": "Potential data loss - all tasks missing from sprint board for enterprise customer with imminent release deadline. Critical incident requiring immediate engineering response."
    },
    {
      "id": "TF-20260216-0042",
      "channel": "whatsapp",
      "customer_name": "Aiden Clark",
      "customer_email": "aiden.clark.tech@gmail.com",
      "customer_plan": "free",
      "subject": "Plan comparison question",
      "message": "whats the difference between pro and enterprise",
      "category": "billing",
      "priority": "low",
      "sentiment": 0.6,
      "expected_action": "Provide a brief comparison of Pro vs Enterprise features: SSO, advanced permissions, custom roles, priority support, higher limits, etc. Share link to pricing page.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0043",
      "channel": "whatsapp",
      "customer_name": "Megan Hughes",
      "customer_email": "megan.hughes.dev@gmail.com",
      "customer_plan": "pro",
      "subject": "GitHub integration question",
      "message": "can I connect github to taskflow? need to link commits to tasks",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.6,
      "expected_action": "Confirm GitHub integration is available, provide brief setup instructions (Settings > Integrations > GitHub > Connect), and explain the TF-ID commit message format for linking.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0044",
      "channel": "whatsapp",
      "customer_name": "Brandon Taylor",
      "customer_email": "brandon.taylor.pm@gmail.com",
      "customer_plan": "pro",
      "subject": "Storage limit inquiry",
      "message": "how much storage do i get on pro",
      "category": "billing",
      "priority": "low",
      "sentiment": 0.6,
      "expected_action": "Provide Pro plan storage limits (e.g., 50GB per workspace), mention per-file size limits, and explain options if more storage is needed.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0045",
      "channel": "whatsapp",
      "customer_name": "Vanessa Price",
      "customer_email": "vanessa.price.co@gmail.com",
      "customer_plan": "pro",
      "subject": "Very angry - nothing works",
      "message": "THIS APP IS GARBAGE NOTHING WORKS I WANT MY MONEY BACK",
      "category": "complaint",
      "priority": "high",
      "sentiment": 0.05,
      "expected_action": "Respond empathetically, apologize for the frustration, ask specifically what issues they're experiencing, and offer to connect them with a senior support agent. Initiate refund process if requested.",
      "should_escalate": true,
      "escalation_reason": "Extremely angry customer demanding refund. No specific issue identified. Requires de-escalation by senior agent and potential refund processing."
    },
    {
      "id": "TF-20260216-0046",
      "channel": "web-form",
      "customer_name": "Patrick O'Brien",
      "customer_email": "p.obrien@pixelcraft.design",
      "customer_plan": "pro",
      "subject": "Bug: Kanban board drag-and-drop broken in Safari",
      "message": "Drag-and-drop on the Kanban board is completely non-functional in Safari (version 17.3 on macOS Sonoma). Cards can be picked up but cannot be dropped into other columns. The card snaps back to its original position every time. This works fine in Chrome and Firefox. Please fix this as several of our team members use Safari as their primary browser.",
      "category": "bug-report",
      "priority": "high",
      "sentiment": 0.4,
      "expected_action": "Confirm the Safari-specific bug, log it with browser version and OS details, provide a workaround (use Chrome/Firefox temporarily), and give an expected timeline for a fix.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0047",
      "channel": "web-form",
      "customer_name": "Diana Kowalski",
      "customer_email": "d.kowalski@streamlineops.com",
      "customer_plan": "pro",
      "subject": "Feature Request: Dark mode for web application",
      "message": "I'd like to request a dark mode option for the TaskFlow web application. Many of our team members work late hours and the bright interface causes eye strain. Most modern SaaS tools offer this as a standard feature. It would be great if it could sync with the OS-level dark mode setting as well.",
      "category": "feature-request",
      "priority": "low",
      "sentiment": 0.7,
      "expected_action": "Thank the customer for the feature request, log it in the feature request tracker, mention if dark mode is on the roadmap, and suggest browser extensions as a temporary workaround.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0048",
      "channel": "web-form",
      "customer_name": "Victor Andersen",
      "customer_email": "v.andersen@buildright.co",
      "customer_plan": "pro",
      "subject": "How to create subtasks and set up dependencies",
      "message": "I'm trying to break down large tasks into smaller subtasks and create dependencies between them (e.g., Task B can't start until Task A is complete). I can see the subtask option but I'm not sure how to set up the dependency links. Is there a way to do this in the list view or only in the Gantt chart?",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.7,
      "expected_action": "Provide instructions for creating subtasks and setting up task dependencies. Explain that dependencies can be set in both list view (via task details) and Gantt chart (by dragging connection lines). Link to documentation.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0049",
      "channel": "web-form",
      "customer_name": "Karen Zhao",
      "customer_email": "karen.zhao@novafinance.com",
      "customer_plan": "pro",
      "subject": "Switch from monthly to annual billing",
      "message": "I'd like to switch our team's billing from monthly ($29.99/user/month) to annual billing to take advantage of the discounted rate. We currently have 12 users on our workspace. Can you help process this change and let me know what the prorated amount would be?",
      "category": "billing",
      "priority": "medium",
      "sentiment": 0.7,
      "expected_action": "Calculate prorated amount for switching 12 seats from monthly to annual, explain the process (Settings > Billing > Change to Annual), and confirm the discounted rate. Process the switch if needed.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0050",
      "channel": "web-form",
      "customer_name": "Steven Grant",
      "customer_email": "s.grant@velocitydigital.io",
      "customer_plan": "free",
      "subject": "Cannot accept workspace invitation - link expired",
      "message": "I received a workspace invitation from my colleague but when I click the link, it says 'Invitation link has expired.' The invitation was sent yesterday. I've asked my colleague to resend it twice now and the same thing happens each time. My email is s.grant@velocitydigital.io.",
      "category": "technical",
      "priority": "medium",
      "sentiment": 0.4,
      "expected_action": "Investigate why invitation links are expiring prematurely, check if there's an email security tool modifying/pre-fetching links, suggest sending invitation directly from within TaskFlow, and verify the user's email isn't already associated with another account.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0051",
      "channel": "web-form",
      "customer_name": "Angela Morrison",
      "customer_email": "a.morrison@trustshield.com",
      "customer_plan": "enterprise",
      "subject": "Request for SOC 2 compliance documentation",
      "message": "Our security team is conducting a vendor assessment and we need to review TaskFlow's SOC 2 Type II report and any other relevant compliance certifications. Could you please provide us with your latest SOC 2 report, data processing agreement (DPA), and information about your security practices? This is required before we can proceed with expanding our deployment.",
      "category": "account",
      "priority": "medium",
      "sentiment": 0.6,
      "expected_action": "Provide SOC 2 Type II report (or link to security page), share DPA, direct to trust/security center, and offer to schedule a call with the security team if additional questions arise.",
      "should_escalate": true,
      "escalation_reason": "Compliance documentation request from enterprise customer's security team. Requires legal/compliance team to provide SOC 2 report and DPA."
    },
    {
      "id": "TF-20260216-0052",
      "channel": "web-form",
      "customer_name": "Neil Patterson",
      "customer_email": "neil.p@fieldforce.co",
      "customer_plan": "pro",
      "subject": "Offline mode not syncing after reconnecting to internet",
      "message": "I use TaskFlow's offline mode when I'm on job sites with poor connectivity. The problem is that when I get back online, the changes I made offline don't sync properly. Some task updates come through but others are lost entirely. This has happened three times in the past two weeks and I've lost hours of work updating task statuses and notes.",
      "category": "bug-report",
      "priority": "high",
      "sentiment": 0.3,
      "expected_action": "Investigate offline sync reliability, check for known issues with offline mode, collect device and app version details, and escalate to engineering if this is a recurring issue. Apologize for lost work.",
      "should_escalate": true,
      "escalation_reason": "Recurring data loss from offline sync failures. Customer has lost work multiple times. Requires engineering investigation into offline sync reliability."
    },
    {
      "id": "TF-20260216-0053",
      "channel": "web-form",
      "customer_name": "Isabelle Durand",
      "customer_email": "i.durand@europrojects.eu",
      "customer_plan": "enterprise",
      "subject": "Feature Request: Gantt chart on mobile app",
      "message": "We love the Gantt chart feature on the web app but it's completely absent from the mobile app. Our project managers frequently need to review timelines while away from their desks. Could you please add Gantt chart viewing (even if read-only) to the iOS and Android apps? This would be a huge productivity boost for our team.",
      "category": "feature-request",
      "priority": "low",
      "sentiment": 0.8,
      "expected_action": "Thank for the feedback, log the feature request, share any mobile Gantt chart roadmap plans if available, and suggest using the mobile browser as a temporary workaround.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0054",
      "channel": "web-form",
      "customer_name": "Greg Watkins",
      "customer_email": "g.watkins@agilewerks.com",
      "customer_plan": "pro",
      "subject": "How to set up WIP limits on Kanban board",
      "message": "I want to enforce work-in-progress limits on our Kanban columns to prevent our team from taking on too much at once. For example, I want to limit the 'In Progress' column to a maximum of 5 cards. I can't find this setting anywhere in the board configuration. Does TaskFlow support WIP limits?",
      "category": "how-to",
      "priority": "low",
      "sentiment": 0.6,
      "expected_action": "Explain WIP limit configuration: Board Settings > Columns > click column name > set WIP limit. Clarify if it's a hard limit (blocks cards) or soft limit (shows warning). Mention plan availability.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0055",
      "channel": "web-form",
      "customer_name": "Michelle Evans",
      "customer_email": "m.evans@ridgeline.com",
      "customer_plan": "pro",
      "subject": "Duplicate charges on credit card - requesting refund",
      "message": "I was charged twice on February 1st for my Pro subscription: $29.99 at 2:14 AM and another $29.99 at 2:17 AM. Both charges appear on my credit card statement. I've attached screenshots of both charges. Please refund the duplicate charge as soon as possible. My workspace ID is WS-8834.",
      "category": "billing",
      "priority": "high",
      "sentiment": 0.3,
      "expected_action": "Verify duplicate charges in billing system for workspace WS-8834, process refund for the duplicate charge, apologize for the error, and confirm refund timeline (3-5 business days).",
      "should_escalate": true,
      "escalation_reason": "Duplicate billing charge requiring immediate refund. Financial discrepancy needs billing team verification and processing."
    },
    {
      "id": "TF-20260216-0056",
      "channel": "web-form",
      "customer_name": "Alan Fischer",
      "customer_email": "a.fischer@crestmont.org",
      "customer_plan": "enterprise",
      "subject": "Workspace owner left company - need ownership transfer",
      "message": "The original creator and owner of our TaskFlow workspace (mark.reynolds@crestmont.org) has left our organization. We need to transfer workspace ownership to me as the new IT administrator. Mark's email has been deactivated by our IT department, so he cannot perform the transfer himself. How do we handle this?",
      "category": "account",
      "priority": "high",
      "sentiment": 0.5,
      "expected_action": "Initiate workspace ownership transfer process, verify requester's identity and authority (company domain, IT admin role), collect required verification documents, and process the transfer. Escalate to account management.",
      "should_escalate": true,
      "escalation_reason": "Workspace ownership transfer required. Previous owner no longer accessible. Requires identity verification and manual administrative action."
    },
    {
      "id": "TF-20260216-0057",
      "channel": "web-form",
      "customer_name": "Rachel Greenfield",
      "customer_email": "r.greenfield@suncoastmedia.com",
      "customer_plan": "pro",
      "subject": "Feedback: Love the product, a few suggestions",
      "message": "Just wanted to say that our team has been using TaskFlow for about 4 months now and we love it! The Kanban boards and sprint planning features have really improved our workflow. A couple of small suggestions: (1) It would be nice to have custom color themes for different projects, (2) A built-in Pomodoro timer alongside the time tracker would be amazing, and (3) Keyboard shortcuts for common actions would speed things up a lot. Keep up the great work!",
      "category": "feedback",
      "priority": "low",
      "sentiment": 0.95,
      "expected_action": "Thank the customer warmly for the positive feedback, log the three feature suggestions, mention any existing keyboard shortcuts (if available), and share if any of these are on the roadmap.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0058",
      "channel": "web-form",
      "customer_name": "Philip Harmon",
      "customer_email": "p.harmon@nexgensoft.com",
      "customer_plan": "enterprise",
      "subject": "Guest user permissions not working correctly",
      "message": "We've added several external contractors as guest users to specific projects, but their permissions aren't being enforced properly. Guests who should only have 'View' access are somehow able to edit task descriptions and move cards on the Kanban board. This is a serious security concern as these are sensitive client projects. Our workspace ID is WS-5561.",
      "category": "bug-report",
      "priority": "critical",
      "sentiment": 0.2,
      "expected_action": "Treat as security issue. Immediately investigate guest permission enforcement for WS-5561, check for permission escalation bugs, verify role assignments, and provide a timeline for fix. Escalate to security team.",
      "should_escalate": true,
      "escalation_reason": "Security vulnerability - guest users can bypass view-only permissions and edit content in sensitive projects. Enterprise customer. Requires immediate security team investigation."
    },
    {
      "id": "TF-20260216-0059",
      "channel": "web-form",
      "customer_name": "Diane Kowalczyk",
      "customer_email": "d.kowalczyk@greystone.consulting",
      "customer_plan": "enterprise",
      "subject": "Data export taking more than 24 hours",
      "message": "I initiated a full workspace data export yesterday morning (February 15th at 9:00 AM) and it's still showing as 'Processing' more than 24 hours later. Our workspace has approximately 50 projects and 8,000 tasks. The export should include all tasks, comments, attachments, and activity logs. Is this normal for a workspace of this size, or is something stuck?",
      "category": "technical",
      "priority": "high",
      "sentiment": 0.4,
      "expected_action": "Check the data export job status on the backend, determine if it's stuck or still processing, provide an estimated completion time, and if stuck, restart the export job. 24+ hours is likely abnormal.",
      "should_escalate": true,
      "escalation_reason": "Data export job appears stuck for 24+ hours. Enterprise customer. Requires backend investigation to check export queue and job status."
    },
    {
      "id": "TF-20260216-0060",
      "channel": "web-form",
      "customer_name": "Frederik Larsen",
      "customer_email": "f.larsen@nordicsystems.dk",
      "customer_plan": "enterprise",
      "subject": "Question about data residency for EU customers",
      "message": "We are an EU-based company subject to strict data residency requirements. Before we can proceed with deploying TaskFlow across our organization, we need to confirm: (1) Where is our data physically stored? (2) Do you offer EU-specific data centers? (3) Does any data leave the EU for processing or backups? This information is required by our legal department for regulatory compliance.",
      "category": "account",
      "priority": "medium",
      "sentiment": 0.6,
      "expected_action": "Provide data residency information, confirm EU data center availability (if applicable), explain data processing and backup locations, and offer to connect with compliance team for detailed documentation.",
      "should_escalate": true,
      "escalation_reason": "Data residency compliance question from EU enterprise prospect. Requires legal/compliance team input regarding data center locations and EU data processing."
    },
    {
      "id": "TF-20260216-0061",
      "channel": "web-form",
      "customer_name": "Unknown",
      "customer_email": "xk29zzbot@tempmail.xyz",
      "customer_plan": "free",
      "subject": "asdfghjkl buy cheap watches",
      "message": "Buy ch3ap w@tches and handb@gs at www dot totallylegit dot biz. Best prices guaranteed!!! Click now for 90% off designer brands. Limited time offer act fast. Also check out our crypto investment opportunity guaranteed 500% returns no risk.",
      "category": "feedback",
      "priority": "low",
      "sentiment": 0.5,
      "expected_action": "Flag as spam, do not respond, add sender email to spam filter, and close the ticket automatically. No customer action needed.",
      "should_escalate": false,
      "escalation_reason": null
    },
    {
      "id": "TF-20260216-0062",
      "channel": "web-form",
      "customer_name": "Samira Patel",
      "customer_email": "s.patel@clearview.io",
      "customer_plan": "pro",
      "subject": "Bug: Task labels disappearing after page refresh",
      "message": "I've noticed that custom labels I apply to tasks disappear after I refresh the page. I can add a label (e.g., 'Urgent', 'Client Feedback'), and it shows up immediately, but when I navigate away and come back, the label is gone. This has been happening for about three days. Other task changes like assignee, due date, and description save fine. It's only the labels that don't persist.",
      "category": "bug-report",
      "priority": "high",
      "sentiment": 0.4,
      "expected_action": "Investigate label persistence issue, check if it's a frontend caching issue or a backend save failure, verify API responses when labels are applied, and provide a workaround or timeline for fix.",
      "should_escalate": false,
      "escalation_reason": null
    }
  ]
}